unicab369/ch32mess/examples/a_mess_coprocessor/2_Device/modI2C.h
//! compute vertical line
void compute_verLine(
	uint8_t x, Limit y_limit, uint8_t thickness, uint8_t mirror
) {
    // Validate coordinates
    if (x >= SSD1306_W) return;

	// Clamp to display bounds
    if (y_limit.l0 >= SSD1306_H) y_limit.l0 = SSD1306_H_LIMIT;
    if (y_limit.l1 >= SSD1306_H) y_limit.l1 = SSD1306_H_LIMIT;

	// Handle mirroring
	if (mirror) {
		y_limit.l0 = SSD1306_H_LIMIT - y_limit.l0;
		y_limit.l1 = SSD1306_H_LIMIT - y_limit.l1;
	}

	// Ensure y1 <= y2 (swap if needed)
	if (y_limit.l0 > y_limit.l1) {
		uint8_t temp = y_limit.l0;
		y_limit.l0 = y_limit.l1;
		y_limit.l1 = temp;
	}

    // Handle thickness
    uint8_t x_end = x + thickness - 1;
    if (x_end >= SSD1306_W) x_end = SSD1306_W_LIMIT;
	if (x_end < x) return;  // Skip if thickness causes overflow

    // // Draw vertical line with thickness
    // for (uint8_t y_pos = y_limit.l0; y_pos <= y_limit.l1; y_pos++) {
    //     M_Page_Mask mask = page_masks[y_pos];
		
    //     for (uint8_t x_pos = x; x_pos <= x_end; x_pos++) {
    //         frame_buffer[mask.page][x_pos] |= mask.bitmask;
    //     }
    // }

	//# Optimized: save 500-700 us
	uint8_t x_len = x_end - x + 1;  // Precompute length

	for (uint8_t y_pos = y_limit.l0; y_pos <= y_limit.l1; y_pos++) {
		M_Page_Mask mask = page_masks[y_pos];
		uint8_t* row_start = &frame_buffer[mask.page][x];  	// Get row pointer

		for (uint8_t i = 0; i < x_len; i++) {
			row_start[i] |= mask.bitmask;  					// Sequential access
		}
	}
}

//! compute line (Bresenham's algorithm)
void compute_line(Point p0, Point p1, uint8_t thickness) {
    // Clamp coordinates to display bounds
    p0.x = (p0.x < SSD1306_W) ? p0.x : SSD1306_W_LIMIT;
    p0.y = (p0.y < SSD1306_H) ? p0.y : SSD1306_H_LIMIT;
    p1.x = (p1.x < SSD1306_W) ? p1.x : SSD1306_W_LIMIT;
    p1.y = (p1.y < SSD1306_H) ? p1.y : SSD1306_H_LIMIT;

    // Bresenham's line algorithm
    int16_t dx = abs(p1.x - p0.x);
    int16_t dy = -abs(p1.y - p0.y);
    int16_t sx = p0.x < p1.x ? 1 : -1;
    int16_t sy = p0.y < p1.y ? 1 : -1;
    int16_t err = dx + dy;
    int16_t e2;

	// Precompute these before the loop:
	uint8_t *fb_base = &frame_buffer[0][0];
	uint8_t radius = thickness >> 1; 		// thickness/2 via bit shift

	while (1) {
		// Draw the pixel(s)
		if (thickness == 1) {
			// Fast path for single-pixel
			if (p0.x < SSD1306_W && p0.y < SSD1306_H) {
                M_Page_Mask mask = page_masks[p0.y];
                frame_buffer[mask.page][p0.x] |= mask.bitmask;
			}
		} else {
			uint8_t x_end = p0.x + radius;
			uint8_t y_end = p0.y + radius;

			// Calculate bounds (branchless min/max)
			uint8_t x_start = p0.x > radius ? p0.x - radius : 0;
			uint8_t y_start = p0.y > radius ? p0.y - radius : 0;

			if (x_end > SSD1306_W_LIMIT) x_end = SSD1306_W_LIMIT;
			if (y_end > SSD1306_H_LIMIT) y_end = SSD1306_H_LIMIT;
			uint8_t width = x_end - x_start + 1;

			// Optimized row filling
			for (uint8_t y = y_start; y <= y_end; y++) {
				M_Page_Mask mask = page_masks[y];
				uint8_t *row = fb_base + (mask.page * SSD1306_W) + x_start;
				
				// Unroll small widths (1-4 pixels common)
				switch(width) {
					case 4: row[3] |= mask.bitmask; // fallthrough
					case 3: row[2] |= mask.bitmask; // fallthrough
					case 2: row[1] |= mask.bitmask; // fallthrough
					case 1: row[0] |= mask.bitmask; break;
					default: 
						for (uint8_t i = 0; i < width; i++) 
							row[i] |= mask.bitmask;
				}
			}
		}

		// Bresenham Advance
		if (p0.x == p1.x && p0.y == p1.y) break;
		e2 = err << 1; // e2 = 2*err via bit shift
		if (e2 >= dy) { err += dy; p0.x += sx; }
		if (e2 <= dx) { err += dx; p0.y += sy; }
	}
}


//! compute rectangle
void compute_rectangle(
	Point p0, Area area, uint8_t fill, uint8_t mirror
) {
	// Validate coordinates
	if (p0.x >= SSD1306_W || p0.y >= SSD1306_H) return;

	// Clamp to display bounds
	uint16_t x_end = p0.x + area.w;
	uint16_t y_end = p0.y + area.h;
	if (x_end >= SSD1306_W) area.w = SSD1306_W_LIMIT - p0.x;
	if (y_end >= SSD1306_H) area.h = SSD1306_H_LIMIT - p0.y;

	// Handle mirroring
	if (mirror) {
		p0.x = SSD1306_W_LIMIT - p0.x;
		area.w = SSD1306_W_LIMIT - area.w;
	}

	// Draw rectangle with optional fill
	Limit hLimit = { l0: p0.x, l1: x_end };
    if (fill) {
		// Filled rectangle using horizontal lines (faster for row-major displays)
		for (uint8_t y_pos = p0.y; y_pos <= y_end; y_pos++) {
			compute_horLine(y_pos, hLimit, 1, 0);
		}
    } else {
		Limit vLimit = { l0: p0.y + 1, l1: y_end - 1 };

        // Outline only
        compute_horLine(p0.y, hLimit, 1, 0);     	// Top edge
        compute_horLine(y_end, hLimit, 1, 0);    	// Bottom edge
        compute_verLine(p0.x, vLimit, 1, 0); 		// Left edge
        compute_verLine(x_end, vLimit, 1, 0); 		// Right edge
    }
}

//! compute pixel
void compute_pixel(uint8_t x, uint8_t y) {
    if (x >= SSD1306_W || y >= SSD1306_H) return; // Skip if out of bounds
    M_Page_Mask mask = page_masks[y];
    frame_buffer[mask.page][x] |= mask.bitmask;
}

//! compute_fastHorLine
void compute_fastHorLine(uint8_t y, uint8_t x0, uint8_t x1) {
    if (y >= SSD1306_H) return;
    
	// Clamp x-coordinates
	if (x0 >= SSD1306_W) x0 = SSD1306_W_LIMIT;
	if (x1 >= SSD1306_W) x1 = SSD1306_W_LIMIT;

    M_Page_Mask mask = page_masks[y];
    for (uint8_t x = x0; x <= x1; x++) {
        frame_buffer[mask.page][x] |= mask.bitmask;
    }
}

//! compute circle (Bresenham's algorithm)
void compute_circle(
	Point p0, uint8_t radius, uint8_t fill
) {
	// Validate center coordinates
	if (p0.x >= SSD1306_W || p0.y >= SSD1306_H) return;

    int16_t x = -radius;
    int16_t y = 0;
    int16_t err = 2 - 2 * radius;
	int16_t e2;

    do {
        // Calculate endpoints with clamping
        uint8_t x_start 	= p0.x + x;
        uint8_t x_end   	= p0.x - x;
        uint8_t y_top   	= p0.y - y;
        uint8_t y_bottom 	= p0.y + y;

		if (fill) {
            // Draw filled horizontal lines (top and bottom halves)
            compute_fastHorLine(y_top, x_start, x_end);     // Top half
            compute_fastHorLine(y_bottom, x_start, x_end);  // Bottom half
		} else {
			uint8_t xy_start 	= p0.x + y;
			uint8_t xy_end   	= p0.x - y;
			uint8_t yx_start 	= p0.y + x;
			uint8_t yx_end   	= p0.y - x;

			// Draw all 8 symmetric points (using precomputed page_masks)
			compute_pixel(x_end		, y_bottom); 	// Octant 1
			compute_pixel(x_start	, y_bottom); 	// Octant 2
			compute_pixel(x_start	, y_top); 		// Octant 3
			compute_pixel(x_end		, y_top); 		// Octant 4
			compute_pixel(xy_end	, yx_start); 	// Octant 5
			compute_pixel(xy_start	, yx_start); 	// Octant 6
			compute_pixel(xy_start	, yx_end); 		// Octant 7
			compute_pixel(xy_end	, yx_end); 		// Octant 8
		}

        // Update Bresenham error
		e2 = err;
        if (e2 <= y) {
            err += ++y * 2 + 1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x * 2 + 1;
    } while (x <= 0);
}



