unicab369/ch32mess/examples/a_mess_coprocessor/2_Device/modI2C.h
// Helper function to get circle point using SIN_LUT
static void get_circle_point(Point center, uint8_t radius, int16_t angle, int16_t *x, int16_t *y) {
    uint8_t quadrant = angle / 90;
    uint8_t reduced_angle = angle % 90;
    uint8_t sin_val = SIN_LUT[reduced_angle];
    uint8_t cos_val = SIN_LUT[90 - reduced_angle];
    
    switch (quadrant) {
        case 0: *x = center.x + (radius * cos_val) / 255;
                *y = center.y - (radius * sin_val) / 255;
                break;
        case 1: *x = center.x - (radius * sin_val) / 255;
                *y = center.y - (radius * cos_val) / 255;
                break;
        case 2: *x = center.x - (radius * cos_val) / 255;
                *y = center.y + (radius * sin_val) / 255;
                break;
        case 3: *x = center.x + (radius * sin_val) / 255;
                *y = center.y + (radius * cos_val) / 255;
                break;
    }
}

//! compute pie
void compute_pie(Point center, uint8_t radius, int16_t start_angle, int16_t end_angle) {    
    // Draw center point
    compute_pixel(center.x, center.y);
    
    // Special case: full circle
    if (start_angle == end_angle) {
        compute_circle(center, radius, 1); // Fill entire circle
        return;
    }
    
    // Angle stepping (adaptive based on radius)
    uint8_t step = (radius > 40) ? 2 : 1;
    
    // Draw radial lines
    int16_t angle = start_angle;
	int16_t x, y;
	
    while (1) {
        // Calculate edge point
        get_circle_point(center, radius, angle, &x, &y);
        
        // Draw line from center to edge
		Point p0 = { x: center.x, y: center.y };
		Point p1 = { x: x, y: y };
		compute_line(p0, p1, 1);
        
        // Break conditions
        if (angle == end_angle) break;
        
        // Move to next angle
        angle = (angle + step) % 360;
        
        // Handle wrap-around
        if (start_angle > end_angle && angle < start_angle && angle > end_angle) break;
    }
}


//! compute ring (Bresenham's algorithm)
void compute_ring(
	Point p0, uint8_t radius, uint8_t thickness,
	int16_t start_angle, int16_t end_angle
) {
    // Early exit if center is off-screen or radius is 0
    if ((p0.x >= SSD1306_W) | (p0.y >= SSD1306_H) | (radius == 0)) return;
    // Precompute display bounds and thickness
    uint8_t inner_r = (thickness >= radius) ? 1 : (radius - thickness);
    uint8_t* const frame_base = &frame_buffer[0][0];
		
    // Draw concentric circles (outer to inner)
    for (uint8_t r = radius; r >= inner_r; r--) {
        int16_t x = -r;
        int16_t y = 0;
        int16_t err = 2 - 2 * r;
		
        do {
            // Calculate and clamp coordinates with 1-pixel extension
            int16_t x_start = p0.x + x;
            int16_t x_end   = p0.x - x;
            int16_t y_top    = p0.y - y;
            int16_t y_bottom = p0.y + y;

			// //! Fill out 2 extra pixels besides x to make ensure no missing
			// //! pixel when drawing the circles
			int16_t x_left  = x_start - 1;
            int16_t x_right = x_end + 1;

            // Skip pixels outside valid screen bounds
            if (y_top >= 0 && y_top < SSD1306_H) {
                M_Page_Mask mask_t = page_masks[y_top];
                uint8_t* row_t = frame_base + (mask_t.page * SSD1306_W);

                if (x_left >= 0 && x_left < SSD1306_W) 		row_t[x_left]  |= mask_t.bitmask;
                if (x_start >= 0 && x_start < SSD1306_W) 	row_t[x_start] |= mask_t.bitmask;
                if (x_end >= 0 && x_end < SSD1306_W) 		row_t[x_end]   |= mask_t.bitmask;
                if (x_right >= 0 && x_right < SSD1306_W) 	row_t[x_right] |= mask_t.bitmask;
            }

            if (y_bottom >= 0 && y_bottom < SSD1306_H) {
                M_Page_Mask mask_b = page_masks[y_bottom];
                uint8_t* row_b = frame_base + (mask_b.page * SSD1306_W);

                if (x_left >= 0 && x_left < SSD1306_W) 		row_b[x_left]  |= mask_b.bitmask;
                if (x_start >= 0 && x_start < SSD1306_W) 	row_b[x_start] |= mask_b.bitmask;
                if (x_end >= 0 && x_end < SSD1306_W) 		row_b[x_end]   |= mask_b.bitmask;
                if (x_right >= 0 && x_right < SSD1306_W) 	row_b[x_right] |= mask_b.bitmask;
            }

            // Optimized Bresenham step
            int16_t e2 = err;
            if (e2 <= y) err += ++y * 2 + 1;  // y*2+1
            if (e2 > x)  err += ++x * 2 + 1;  // x*2+1
        } while (x <= 0);
    }
}

//! compute curve
void compute_curve(uint8_t* points, uint8_t num_points, uint8_t thickness, uint8_t mirror) {
    // Validate input
    if (num_points < 2 || thickness == 0) return;

    // Precompute constants
    const uint8_t* fb_base = &frame_buffer[0][0];
    const uint16_t page_stride = SSD1306_W;
    const uint8_t radius = thickness >> 1;

    // Draw curve segments
    for (uint8_t i = 0; i < num_points - 1; i++) {
        uint8_t x0 = points[i*2];
        uint8_t y0 = points[i*2+1];
        uint8_t x1 = points[(i+1)*2];
        uint8_t y1 = points[(i+1)*2+1];

        // Mirror if needed
        if (mirror) {
            x0 = SSD1306_W_LIMIT - x0;
            y0 = SSD1306_H_LIMIT - y0;
            x1 = SSD1306_W_LIMIT - x1;
            y1 = SSD1306_H_LIMIT - y1;
        }

        // Bresenham's line algorithm with thickness
        int16_t dx = abs(x1 - x0);
        int16_t dy = -abs(y1 - y0);
        int8_t sx = x0 < x1 ? 1 : -1;
        int8_t sy = y0 < y1 ? 1 : -1;
        int16_t err = dx + dy;
        int16_t e2;

        while (1) {
            // Draw thick pixel
            uint8_t x_start = x0 > radius ? x0 - radius : 0;
            uint8_t x_end = (x0 + radius) < SSD1306_W_LIMIT ? (x0 + radius) : SSD1306_W_LIMIT;
            uint8_t y_start = y0 > radius ? y0 - radius : 0;
            uint8_t y_end = (y0 + radius) < SSD1306_H_LIMIT ? (y0 + radius) : SSD1306_H_LIMIT;

            for (uint8_t y = y_start; y <= y_end; y++) {
                M_Page_Mask mask = page_masks[y];
                uint8_t* row = fb_base + (mask.page * page_stride) + x_start;
                uint8_t pixel_width = x_end - x_start + 1;

                // Optimized fill patterns
                switch (pixel_width) {
                    case 4: row[3] |= mask.bitmask; // fallthrough
                    case 3: row[2] |= mask.bitmask; // fallthrough
                    case 2: row[1] |= mask.bitmask; // fallthrough
                    case 1: row[0] |= mask.bitmask; break;
                    default:
                        for (uint8_t x = 0; x < pixel_width; x++) {
                            row[x] |= mask.bitmask;
                        }
                }
            }

            if (x0 == x1 && y0 == y1) break;
            e2 = err << 1; // e2 = 2*err via bit shift
            if (e2 >= dy) { err += dy; x0 += sx; }
            if (e2 <= dx) { err += dx; y0 += sy; }
        }
    }
}

// #include "lib_rand.h"

void modI2C_setup() {
	precompute_page_masks();

	// # SSD1306
	if(!ssd1306_i2c_init()) {
		ssd1306_init();
		printf("done.\n\r");
	}
	
